app/Http/Controllers/AlumnoController.php

SELECT * FROM `personas` WHERE `personas`.`id` = 16 LIMIT 1
---
    public function show(int $id){
        //select de un estudiante
        $estudiante = Persona::find($id);

SELECT `alumnos`.`id_alumno`, `personas`.`nombre`, `personas`.`apellidos`, `cursos`.`nombre` as `curso`, `grados`.`nombre` as `grado`, `empresas`.`nombre` as `empresa` FROM `alumnos` inner join `personas` on `alumnos`.`id_alumno` = `personas`.`id` inner join `cursos` on `alumnos`.`id_curso` = `cursos`.`id` inner join `grados` on `cursos`.`id_grado` = `grados`.`id` inner join `tutores_empresas` on `alumnos`.`id_tutor_empresa` = `tutores_empresas`.`id_tutor_empresa` inner join `empresas` on `tutores_empresas`.`id_empresa` = `empresas`.`id` WHERE (`personas`.`nombre` like '%%%' and `cursos`.`id` like '%' and `grados`.`id` like '1' and `empresas`.`id` like '%')
---
    public static function selectAllAlumnos(Request $request)
    {
        $request->validate([
            'nombre' => 'string|max:255|nullable',
            'curso' => 'numeric',
            'grado' => 'numeric',
            'empresa' => 'numeric',
            'pagina' => 'numeric|nullable',
        ]);
        $pagina = $request->pagina;

        $request->grado = $request->grado == 0 ? '%' : $request->grado;
        $request->curso = $request->curso == 0 ? '%' : $request->curso;
        $request->empresa = $request->empresa == 0 ? '%' : $request->empresa;
        $request->nombre = $request->nombre == '' ? '%' : $request->nombre;
        $request->page = $request->page == '' ? 1 : $request->page;
        //query with join id_alumno, id_persona
        $estudiantes = Alumno::join('personas', 'alumnos.id_alumno', '=', 'personas.id')
            ->join('cursos', 'alumnos.id_curso', '=', 'cursos.id')
            ->join('grados', 'cursos.id_grado', '=', 'grados.id')
            ->join('tutores_empresas', 'alumnos.id_tutor_empresa', '=', 'tutores_empresas.id_tutor_empresa')
            ->join('empresas', 'tutores_empresas.id_empresa', '=', 'empresas.id')
            ->select('alumnos.id_alumno', 'personas.nombre', 'personas.apellidos', 'cursos.nombre as curso', 'grados.nombre as grado', 'empresas.nombre as empresa')
            ->where([
                ['personas.nombre', 'like', '%' . $request->nombre . '%'],
                ['cursos.id', 'like', $request->curso],
                ['grados.id', 'like', $request->grado],
                ['empresas.id', 'like', $request->empresa],
            ])