app/Http/Controllers/CursoController.php

    public function index()
    {
        $cursos = Curso::all();
---
SELECT * FROM `cursos`