app/Http/Controllers/EmpresasController.php

    public function index()
    {
        $empresas = Empresa::all();
---
SELECT * FROM `empresas`