app/Http/Controllers/GradoController.php

SELECT * FROM `grados`
---
    public function index()
    {
        $grados = Grado::all();