app/Http/Controllers/PersonasController.php

    public function index()
    {
        $personas = Persona::all();
---
SELECT * FROM `personas`